{
       "Course": "Introduction to Probability and Statistics",
       "Topic": "Central Limit Theorem, Probability",
       "Original question": "To head the newly formed US Dept. of Statistics, suppose that 50% of the population supports Erika, 20% supports Ruthi, and the rest are split between Peter, Jon and Jerry. A poll asks 400 random people who they support. Use the central limit theorem to estimate the probability that less than 25% of those polled prefer Peter, Jon or Jerry?",
       "Codex input": "Suppose that 30% of the population supports Peter. A poll asks 400 random people who they support. \nWrite a program that uses the central limit theorem to compute the probability that less than 25% of those polled support Peter.",
       "Codex code": "# The population proportion is 0.3\np = 0.3\n\n# The sample size is 400\nn = 400\n\n# The sample proportion is 0.25\np_hat = 0.25\n\n# The standard deviation of the sample proportion is\nsigma = np.sqrt(p * (1 - p) / n)\n\n# The z-score is\nz = (p_hat - p) / sigma\n\n# The probability is\nprob = stats.norm.cdf(z)\n\nprint(prob)",
       "Codex code explanation": "1. The population proportion is 0.3\n2. The sample size is 400\n3. The sample proportion is 0.25\n4. The standard deviation of the sample proportion is\n5. The z-score is\n6. The probability is",
       "Program solution": 0.0145,
       "Solution type": "Automatic Zero-shot",
       "GPT-3 response": "The central limit theorem states that the distribution of the sample mean will be normal for large sample sizes. In this case, the sample size is 400, which is considered large. The mean of the distribution will be the population mean, which is 50% for Erika, 20% for Ruthi, and 30% for Peter, Jon, and Jerry combined. The standard deviation of the distribution will be the population standard deviation divided by the square root of the sample size. The population standard deviation is unknown, but can be estimated using the sample standard deviation. The sample standard deviation can be calculated using the following formula:\n\ns = √[(n-1)∑(x-μ)^2/n]\n\nwhere n is the sample size, x is each individual value, and μ is the mean.\n\nIn this case, the mean is 30% and the sample size is 400. Plugging these values into the formula above gives us:\n\ns = √[(400-1)∑(x-30)^2/400]\n\ns = √[399∑(x-30)^2/400]\n\ns = √[399(0.3^2+0.2^2+0.1^2+0.1^2+0.1^2)/400]\n\ns = √[399(0.09+0.04+0.01+0.01+0.01)/400]\n\ns = √[399(0.16)/400]\n\ns = √[0.064]\n\ns = 0.25\n\nThe standard deviation of the distribution is 0.25. The distribution will be normal with a mean of 30% and a standard deviation of 0.25.\n\nTo find the probability that less than 25% of those polled prefer Peter, Jon, or Jerry, we need to find the area under the curve to the left of 25%. This can be done using a z-score. The z-score is calculated using the following formula:\n\nz = (x-μ)/σ\n\nwhere x is the value, μ is the mean, and σ is the standard deviation.\n\nIn this case, x is 25%, μ is 30%, and σ is 0.25. Plugging these values into the formula above gives us:\n\nz = (0.25-0.3)/0.25\n\nz = -0.2/0.25\n\nz = -0.8\n\nThe z-score is -0.8. To find the area under the curve to the left of 25%, we need to find the area under the curve to the left of -0.8. This can be done using a z-table. The area under the curve to the left of -0.8 is 0.22. This means that the probability that less than 25% of those polled prefer Peter, Jon, or Jerry is 0.22.",
       "GPT-3 evaluation": "Incorrect"
}