{
       "Course": "Mathematics for Computer Science",
       "Topic": "Probability",
       "Original question": "Outside of their hum­drum duties as 6.042 TAs, Sayan is trying to learn to levitate using only intense concentration and Jelani is launching a “Nelson 2008” presidential campaign. Suppose that Sayan’s probability of levitating is 1/6, Jelani’s chance of becoming president is 1/4, and the success of one does not alter the other’s chances. If at most one of them succeeds, what is the probability that Jelani becomes the president of the United States?",
       "Codex input": "Suppose that Sayan’s probability Sayan succeeding is 1/6, and Jelani's probability of succeeding is 1/4. Use numpy to find the probability at most one of Jelani and Sayan succeed.\nUse numpy to find the probability Jelani succeeds but Sayan does not succeed.\nDivide the former by the latter probability.",
       "Codex code": "import numpy as np\n\n# Probability of Sayan succeeding\np_sayan = 1/6\n\n# Probability of Jelani succeeding\np_jelani = 1/4\n\n# Probability of at most one of Jelani and Sayan succeeding\np_at_most_one = 1 - (p_sayan * p_jelani)\n\n# Probability of Jelani succeeding but Sayan not succeeding\np_jelani_succeed_sayan_not = p_jelani * (1 - p_sayan)\n\n# Probability of Jelani succeeding but Sayan not succeeding divided by probability of at most one of Jelani and Sayan succeeding\np_jelani_succeed_sayan_not / p_at_most_one\n\n# Probability of at least one of Jelani and Sayan succeeding\np_at_least_one = 1 - p_at_most_one\n",
       "Codex code explanation": "1. We're calculating the probability of Sayan succeeding.\n2. We're calculating the probability of Jelani succeeding.\n3. We're calculating the probability of at most one of Jelani and Sayan succeeding.\n4. We're calculating the probability of Jelani succeeding but Sayan not succeeding.\n5. We're calculating the probability of Jelani succeeding but Sayan not succeeding divided by probability of at most one of Jelani and Sayan succeeding.\n6. We're calculating the probability of at least one of Jelani and Sayan succeeding.",
       "Program solution": "23-May",
       "Solution type": "Manual",
       "GPT-3 response": "# Sayan's probability of levitating is 1/6, Jelani's chance of becoming president is 1/4\n# If at most one of them succeeds, what is the probability that Jelani becomes the president of the United States?\n\n# P(Jelani) = P(Jelani and not Sayan) + P(Jelani and Sayan)\n#           = P(Jelani)P(not Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani)(1 - P(Sayan)) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan) + P(Jelani)P(Sayan)\n#           = P(Jelani) - P(Jelani)P(Sayan)",
       "GPT-3 evaluation": "Incorrect"
}