{
       "Course": "Mathematics for Computer Science",
       "Topic": "Probability",
       "Original question": "Exactly 1/5th of the people in a town have Beaver Fever.  There are two tests for Beaver Fever, TEST1 and TEST2. When a person goes to a doctor to test for Beaver Fever, with probability 2/3 the doctor conducts TEST1 on him and with probability 1/3 the doctor conducts TEST2 on him. When TEST1 is done on a person, the outcome is as follows: If the person has the disease, the result is positive with probability 3/4. If the person does not have the disease, the result is positive with probability 1/4. When TEST2 is done on a person, the outcome is as follows: If the person has the disease, the result is positive with probability 1. If the person does not have the disease, the result is positive with probability 1/2. A person is picked uniformly at random from the town and is sent to a doctor to test for Beaver Fever. The result comes out positive. What is the probability that the person has the disease? ",
       "Codex input": "P(TEST_1) = 2/3\nP(TPR_1) = 3/4\nP(FPR_1) = 1/4\nP(TEST_2) = 1/3\nP(TPR_2) = 1\nP(FPR_2) = 1/2\nP(P) = 1/5\nP(N) = 4/5\nFind P(TEST_1)**2*P(P)*P(TPR_1)/(P(TEST_1)*P(P)*P(TPR_1)+P(TEST_1)*P(N)*P(FPR_1)) + P(TEST_2)**2*P(P)*P(TPR_2)/(P(TEST_2)*P(P)*P(TPR_2)+P(TEST_2)*P(N)*P(FPR_2))",
       "Codex code": "def main():\n    p_test_1 = 2/3\n    p_tpr_1 = 3/4\n    p_fpr_1 = 1/4\n    p_test_2 = 1/3\n    p_tpr_2 = 1\n    p_fpr_2 = 1/2\n    p_p = 1/5\n    p_n = 4/5\n    p_tpr_1_2 = p_test_1**2*p_p*p_tpr_1/(p_test_1*p_p*p_tpr_1+p_test_1*p_n*p_fpr_1)\n    p_tpr_2_2 = p_test_2**2*p_p*p_tpr_2/(p_test_2*p_p*p_tpr_2+p_test_2*p_n*p_fpr_2)\n    print(p_tpr_1_2+p_tpr_2_2)\n\nif __name__ == \"__main__\":\n    main()",
       "Codex code explanation": "1. The code above is calculating the probability of a positive test result given that the patient has the disease.\n2. The code above is calculating the probability of a positive test result given that the patient does not have the disease.\n3. The code above is calculating the probability of a negative test result given that the patient has the disease.\n4. The code above is calculating the probability of a negative test result given that the patient does not have the disease.\n5. The code above is calculating the probability of a positive test result.\n6. The code above is calculating the probability of a negative test result.\n7. The code above is calculating the probability of a patient having the disease.\n8. The code above is calculating the probability of a patient not having the disease.\n9. The code above is calculating the probability of a patient having the disease given a positive test result.\n10. The code above is calculating the probability of a patient having the disease given a negative test result.\n11. The code above is calculating the probability of a patient not having the disease given a positive test result.\n12. The code above is calculating the probability of a patient not having the disease given a negative test result.",
       "Program solution": "13-May",
       "Solution type": "Manual",
       "GPT-3 response": "# Let A be the event that the person has the disease\n# Let B be the event that the person tests positive\n\n# P(A) = 1/5\n# P(B|A) = 3/4\n# P(B|A') = 1/4\n\n# P(B) = P(B|A)P(A) + P(B|A')P(A')\n# P(B) = 3/4(1/5) + 1/4(4/5)\n# P(B) = 3/20 + 1/20\n# P(B) = 1/5\n\n# P(A|B) = P(B|A)P(A)/P(B)\n# P(A|B) = 3/4(1/5)/(1/5)\n# P(A|B) = 3/4",
       "GPT-3 evaluation": "Incorrect"
}