{
       "Course": "Linear Algebra",
       "Topic": "Solving Linear System of Equations",
       "Original question": "A mining company has two mines. One day's operation at mine A produces ore that contains 10 metric tons of copper and 120 kilograms of silver, while one day's operation at mine B produces ore containing 6 metric tons of copper and 140 kilograms of silver. Let a=[10;120] and b=[6;140]. Then a and b represent the daily output of mines A and B, respectively. Suppose that the mining company operates mine A for x days and mine B for y days.\nCalculate how many number of days each mine should operate in order to produce 72 tons of copper and 1340 kilograms of silver.",
       "Codex input": "Same as original question",
       "Codex code": "from sympy import *\n\nx, y = symbols('x y')\n\na = Matrix([10, 120])\nb = Matrix([6, 140])\n\nc = Matrix([72, 1340])\n\nprint(solve([a[0]*x + b[0]*y - c[0], a[1]*x + b[1]*y - c[1]], [x, y]))",
       "Codex code explanation": "1. We're creating two variables, x and y, and assigning them to the symbols 'x' and 'y'\n2. We're creating three matrices, a, b, and c, and assigning them to the values [10, 120], [6, 140], and [72, 1340]\n3. We're using the solve function to solve the system of equations a[0]*x + b[0]*y - c[0] and a[1]*x + b[1]*y - c[1] for x and y\n4. We're printing the solution to the system of equations",
       "Program solution": "x=3, y=7",
       "Solution type": "Automatic Few-shot(1)",
       "GPT-3 response": "Let x be the number of days mine A operates and y be the number of days mine B operates.\n\nWe want to find x and y such that:\n10x+6y=72\n120x+140y=1340\n\nThis can be rewritten as:\n10x+6y-72=0\n120x+140y-1340=0\n\nThis is a system of linear equations that can be solved using substitution or elimination.\n\nUsing substitution, we can solve for y in the first equation and substitute this into the second equation.\n\n10x+6y-72=0\n10x=-6y+72\ny=(10/6)x-(72/6)\ny=(5/3)x-12\n\n120x+140(5/3)x-12(140)-1340=0\n120x+700x/3-1680-1340=0\n120x+700x/3-3020=0\n700x/3+120x-3020=0\n700x/3+120x-3020=0\n700x/3=3020-120x\n700x/3=2800\nx=4000/21\n\ny=(5/3)(4000/21)-12\ny=1666.667-12\ny=1654.667\n\nTherefore, mine A should operate for 4000/21 days and mine B should operate for 1654.667 days.",
       "GPT-3 evaluation": "Incorrect"
}